Repository: Delagen/dart-l10n-gettext
Catalog: l10n/intl_*.arb
Languages: de

source: Dirs to scan
de: Zu scannende Verzeichnisse

source: locales to generate
de: Zu generierende Übersetzungsfiles

source: Suppress Warnings
de: Warnungen unterdrücken

source: yes
de: ja

source: no
de: nein

source: Output dir for .ARB-Files
de: Ausgabeverzeichnis für die .arb-Files

source: Output file
de: Ausgabedatei

source: Use deferred loading
de: Verwende 'deferred loading'

source: Code generation mode
de: Modus für die Kodegenerierung

source: Code generation dir
de: Ausgabeverzeichnis für die generierten .dart-Files

source: Ignore excluded folders
de: Ignorieren der 'excluded' Verzeichnisse

source: Overwrite intl_<locale>
de: Überschreiben von intl_<locale>

source: Dirs to exclude
de: 'exclude' Verzeichnisse

source: Settings:
de: Einstellungen:

source: Found [key] in [file]: [value]
de: '[key]' in [file] gefunden: [value]

source: Usage: mkl10n [options] <dir(s) to scan>
de: Verwendung: mkl10n [options] <scan-Verzeichnis>

source: Example:
de: Beispiel:

source: mkl10n . - Generates lib/locale/messages.dart
de: mkl10n . - E lib/locale/messages.dart

source: mkl10n -l es,de . - Generates translation for es + de
de: mkl10n -l es,de . - Erstellt Übersetzung für es + de

source: Shows this message
de: Zeigt diese Message an

source: Prints settings
de: Gibt die Settings aus

source: locales - separated by colon, Sample: --locales en,de,es
de: locales - Getrennt durch Beistrich, Beispiel: --locales en,de,es

source: Folder where .ARB-Files gets stored
de: Verzeichnis in dem die .arb-Files erstellt werden

source: Exclude folders from scaning
de: 'exclude'-Verzeichnis beim Scan

source: Suppress printing of warnings
de: Warnings unterdrücken

source: Mode to run the code generator in. Either release or debug
de: Mode für den Kode-Generator. Either release or debug

source: Folder where you want to store the generated Dart-Files (Usually inside lib)
de: Verzeichnis für die generierten Dart-Files (Gewöhnlich lib/_l10)

source: Overwrites intl_<local> if it exists
de: Überschreibt intl_<locale> wenn das File existiert

source: Overwrite system locale (demonstration only)
de: System-Locale überschreiben (demo-only)

source: Localized file already exists! ([path])
de: Übersetztes files existiert bereits! ([path])

source: Scanning
de: Durchsuche
